Autodesk.Revit.DB.TableCellStyle.SetCellStyleOverrideOptions(Autodesk.Revit.DB.TableCellStyleOverrideOptions)
Sets cell style override options of this cell.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.TableCellStyle.GetCellStyleOverrideOptions
Gets cell style override options of this cell.
Since:
2014

Autodesk.Revit.DB.TableCellStyle.ResetOverride
Resets any overrides applied to this cell.
Since:
2014

Autodesk.Revit.DB.TableCellStyle.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableCellStyle.FontVerticalAlignment
The vertical alignment style of text font.
Alignment style.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.TableCellStyle.FontHorizontalAlignment
The horizontal alignment style of text font.
Alignment style.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.TableCellStyle.IsInactivePhaseload
Gets or sets whether this is an inactive phase load cell.
true if the font is an inactive phase load cell; otherwise false.

Autodesk.Revit.DB.TableCellStyle.IsFontUnderline
Gets or sets whether the text font is set to Underline of this cell.
true if the font is Underline; otherwise false.

Autodesk.Revit.DB.TableCellStyle.IsFontItalic
Gets or sets whether the text font is set to italic of this cell.
true if the font is italic; otherwise false.

Autodesk.Revit.DB.TableCellStyle.IsFontBold
Gets or sets whether the text font is set to bold of this cell.
true if the font is bold; otherwise false.

Autodesk.Revit.DB.TableCellStyle.IsReadOnly
Gets or sets whether this cell is read only.
true if this cell is read only; otherwise false.

Autodesk.Revit.DB.TableCellStyle.IsEnabled
Gets or sets the status whether this cell is enabled.
True if this cell is enabled; otherwise False.

Autodesk.Revit.DB.TableCellStyle.IsOverridden
Indicates if the cell is overridden or not.
Since:
2014

Autodesk.Revit.DB.TableCellStyle.BorderRightLineStyle
The element id (GraphicsStyle element) for the right line of the cell border.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellStyle.BorderLeftLineStyle
The element id (GraphicsStyle element) for the left line of the cell border.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellStyle.BorderBottomLineStyle
The element id (GraphicsStyle element) for the bottom line of the cell border.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellStyle.BorderTopLineStyle
The element id (GraphicsStyle element) for the top line of the cell border.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellStyle.TextOrientation
The orientation of the cell (for vertical/horizontal text) with input in degrees multiplied by 10

Autodesk.Revit.DB.TableCellStyle.SheetBackgroundColor
The background color of this cell in the sheet view.
Remarks:
In most cases the background color on the sheet view is the same as it is in the grid view.  The background may be different
if conditional formatting is applied only in the grid view.
Since:
2014

Autodesk.Revit.DB.TableCellStyle.BackgroundColor
The background color of this cell in the grid view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellStyle.TextColor
The text color of this cell.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellStyle.TextSize
The text size.

Autodesk.Revit.DB.TableCellStyle.FontName
The font used for this style
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellStyle.#ctor(Autodesk.Revit.DB.TableCellStyle)
Constructs a new copy of the input TableCellStyle object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableCellStyle.#ctor
Constructs a new TableCellStyle with default settings.

Autodesk.Revit.DB.TableCellStyle
The TableCellStyle class contains the appearance settings for a given table cell, column, or table.